In [2]:
import pandas as pd
df5=pd.read_csv(r"C:\Jayasri\class-9\colour.txt")
df5

   colour names^red
0             blue^
1            green^
2           yellow^
3              red^
4            black^
5            brown^
6          skyblue^
7             pink^
8            white^
9           orange^
10           white^

In [4]:
df5.iloc[0:5,0:3]

  colour names^red
0            blue^
1           green^
2          yellow^
3             red^
4           black^

In [12]:
df.head()

  Friend’s names, Quality
0       Rohitha, innocent
1             Geetha, Joy
2    Hareesh, intelligent
3      Supraja,spiritcual
4               Sai,anger

In [13]:
df.tail()

  Friend’s names, Quality
5   Lakshmi,silent killer
6           Divya, silent
7       Krupa, brave girl
8             Rajini, fun
9        Swarna, comedian

In [17]:
df5.shape

(11, 1)

In [6]:
df5.index

RangeIndex(start=0, stop=11, step=1)

In [7]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 1 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   colour names^red  11 non-null     object
dtypes: object(1)
memory usage: 216.0+ bytes

In [8]:
df5.dtypes

colour names^red    object
dtype: object

In [9]:
type(df5)

pandas.core.frame.DataFrame

In [10]:
df5.columns

Index(['colour names^red'], dtype='object')

In [11]:
lst5=list(df5.columns)
lst5

['colour names^red']

In [14]:

lst5=list[0:0]
lst5

list[slice(0, 0, None)]

In [2]:
import pandas as pd
df2=pd.read_csv(r"C:\Jayasri\class-9\vegfood.txt")
df2

    VegFoodName | Taste
0         potato |sweet
1    ladies finger |hot
2          brinjal |hot
3         carrot |sweet
4         onions |sweet
5           cabage |hot
6       califlower |hot
7   bitter guared |hot
8        Ice-cream|cool
9             Bingo|hot
10           drink|cool

In [5]:
import pandas as pd
df=pd.read_csv(r"C:\Jayasri\class-9\MonthName.txt",sep="&")
df

   MonthName        Season
0     january       winter
1    february       winter
2       march       summer
3       april       summer
4         may       summer
5        june  rainyseason
6        july  rainyseason
7      august  rainyseason
8   september  rainyseason
9    octomber  rainyseason
10   november       winter
11   december       winter

In [9]:
import pandas as pd
df=pd.read_csv(r"C:\Jayasri\class-9\09-01.txt")
df

  Friend’s names        Quality
0        Rohitha       innocent
1         Geetha            Joy
2        Hareesh    intelligent
3        Supraja     spiritcual
4            Sai          anger
5        Lakshmi  silent killer
6          Divya         silent
7          Krupa     brave girl
8         Rajini            fun
9         Swarna       comedian

In [11]:
import pandas as pd
df=pd.read_csv(r"C:\Jayasri\class-9\09-01.txt",sep="&")
df

  Friend’s names, Quality
0       Rohitha, innocent
1             Geetha, Joy
2    Hareesh, intelligent
3      Supraja,spiritcual
4               Sai,anger
5   Lakshmi,silent killer
6           Divya, silent
7       Krupa, brave girl
8             Rajini, fun
9        Swarna, comedian

In [18]:
df.head()

  Friend’s names, Quality
0       Rohitha, innocent
1             Geetha, Joy
2    Hareesh, intelligent
3      Supraja,spiritcual
4               Sai,anger

In [19]:
df.tail()

  Friend’s names, Quality
5   Lakshmi,silent killer
6           Divya, silent
7       Krupa, brave girl
8             Rajini, fun
9        Swarna, comedian

In [20]:
df.shape

(10, 1)

In [21]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 1 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Friend’s names, Quality  10 non-null     object
dtypes: object(1)
memory usage: 208.0+ bytes

In [24]:
df.columns

Index(['Friend’s names, Quality'], dtype='object')

In [25]:
type(df)

pandas.core.frame.DataFrame

In [27]:
df.dtypes

Friend’s names, Quality    object
dtype: object

In [31]:
lst=list[df.columns]
lst

list[Index(['Friend’s names, Quality'], dtype='object')]